netify-soap/src/test/resources/soap/requests/role/GetRoleAllRequestFilterCharacterTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://duo.nl/namespace/netify/general"
                  xmlns:role="http://duo.nl/namespace/netify/datatypes/role">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetRoleAllRequest>
            <!--Optional:-->
            <gen:filters>
                <!--Optional:-->
                <role:character>Jason Bourne</role:character>
            </gen:filters>
        </gen:GetRoleAllRequest>
    </soapenv:Body>
</soapenv:Envelope>